scripts/UC_2_buyItem/result1/Iteration2/t36.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:PaymentPreferences xmlns:ns2="com.advantage.online.store.accountservice"><ns2:preference><ns2:paymentMethod>10</ns2:paymentMethod><ns2:safePayUsername>EmilySmith2</ns2:safePayUsername><ns2:safePayPassword>09ac1003ac8366e06dcae801114ff16b289ee4bf</ns2:safePayPassword><ns2:preferenceId>0</ns2:preferenceId></ns2:preference><ns2:preference><ns2:paymentMethod>20</ns2:paymentMethod><ns2:cardNumber>4886901234567890</ns2:cardNumber><ns2:expirationDate>112024</ns2:expirationDate><ns2:cvvNumber>865</ns2:cvvNumber><ns2:customerName>Emily Smith</ns2:customerName><ns2:preferenceId>0</ns2:preferenceId></ns2:preference></ns2:PaymentPreferences></SOAP-ENV:Body></SOAP-ENV:Envelope>